package org.example

fun main(){

    val length: Long = 40868600000 //растоение, которое пролетел гагарин в космосе
    val age: Byte = 27 //Возраст Гагарина на момент полета
    val partOfDay: Double = 0.075 //какую часть дня Гагарин провел в космосе
    val seconds: Short = 6480 //количество секунд которое Гагарин провел в космосе
    val partOfYear: Double = 2.0547945205479453E-4 //какую часть года Гагарин провел в космосе
    val apogee: Int = 327000 //апогей орбиты Гагарина в метрах

    println("Растоение, которое пролетел Гагарин в космосе: $length")
    println("Возраст Гагарина на момент полета: $age")
    println("Какую часть дня Гагарин провел в космосе: $partOfDay")
    println("Количество секунд которое Гагарин провел в космосе: $seconds")
    println("Какую часть года Гагарин провел в космосе: $partOfYear")
    println("Апогей орбиты Гагарина в метрах: $apogee")

}